MikroElektronika/core_packages/ARM/gcc_clang/startup/stm/stm32h7s7l8.s
/**
  ******************************************************************************
  * @file      startup_stm32h7s7xx.s
  * @author    MCD Application Team
  * @brief     STM32H7S7xx Devices vector table for GCC toolchain.
  *            This module performs:
  *                - Set the initial SP
  *                - Set the initial PC == Reset_Handler,
  *                - Set the vector table entries with the exceptions ISR address
  *                - Branches to main in the C library (which eventually
  *                  calls main()).
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

  .syntax unified
  .cpu cortex-m7
  .fpu softvfp
  .thumb

.global  g_pfnVectors
.global  Default_Handler

/* start address for the initialization values of the .data section.
defined in linker script */
.word  _sidata
/* start address for the .data section. defined in linker script */
.word  _sdata
/* end address for the .data section. defined in linker script */
.word  _edata
/* start address for the .bss section. defined in linker script */
.word  _sbss
/* end address for the .bss section. defined in linker script */
.word  _ebss

/**
 * @brief  This is the code that gets called when the processor first
 *          starts execution following a reset event. Only the absolutely
 *          necessary set is performed, after which the application
 *          supplied main() routine is called.
 * @param  None
 * @retval : None
*/

    .section  .text.Reset_Handler
  .weak  Reset_Handler
  .type  Reset_Handler, %function
Reset_Handler:
  ldr   r0, =_estack
  mov   sp, r0          /* set stack pointer */
/* Call the clock system initialization function.*/
  // bl  SystemInit /* Removed call for Mikroe implementation. */

/* Copy the data segment initializers from flash to SRAM */
  ldr r0, =_sdata
  ldr r1, =_edata
  ldr r2, =_sidata
  movs r3, #0
  b LoopCopyDataInit

CopyDataInit:
  ldr r4, [r2, r3]
  str r4, [r0, r3]
  adds r3, r3, #4

LoopCopyDataInit:
  adds r4, r0, r3
  cmp r4, r1
  bcc CopyDataInit

/* Zero fill the bss segment. */
  ldr r2, =_sbss
  ldr r4, =_ebss
  movs r3, #0
  b LoopFillZerobss

FillZerobss:
  str  r3, [r2]
  adds r2, r2, #4

LoopFillZerobss:
  cmp r2, r4
  bcc FillZerobss

/* Call static constructors */
    bl __libc_init_array
/* Call the application's entry point.*/
  bl  clockConfig /* Added to call MikroE system clock configuration API. */
  bl  main

LoopForever:
  b LoopForever

.size  Reset_Handler, .-Reset_Handler

/**
 * @brief  This is the code that gets called when the processor receives an
 *         unexpected interrupt.  This simply enters an infinite loop, preserving
 *         the system state for examination by a debugger.
 *
 * @param  None
 * @retval : None
*/
    .section  .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
  b  Infinite_Loop
  .size  Default_Handler, .-Default_Handler

/******************************************************************************
*
* The STM32H7S7xx vector table. Note that the proper constructs
* must be placed on this to ensure that it ends up at physical address
* 0x0000.0000.
*
******************************************************************************/
   .section  .isr_vector,"a",%progbits
  .type  g_pfnVectors, %object
  .size  g_pfnVectors, .-g_pfnVectors

g_pfnVectors:
  .word  _estack
  .word  Reset_Handler
  .word  NMI_Handler
  .word  HardFault_Handler
  .word  MemManage_Handler
  .word  BusFault_Handler
  .word  UsageFault_Handler
  .word  0
  .word  0
  .word  0
  .word  0
  .word  SVC_Handler
  .word  DebugMon_Handler
  .word  0
  .word  PendSV_Handler
  .word  SysTick_Handler
  /* External Interrupts */
  .word     PVD_PVM_IRQHandler                /* PVD/PVM through EXTI Line detection */
  .word     0                                 /* Reserved */
  .word     DTS_IRQHandler                    /* Digital Temperature Sensor */
  .word     IWDG_IRQHandler                   /* Internal Watchdog */
  .word     WWDG_IRQHandler                   /* Window Watchdog   */
  .word     RCC_IRQHandler                    /* RCC global interrupts through EXTI Line detection */
  .word     0                                 /* Reserved    */
  .word     0                                 /* Reserved    */
  .word     FLASH_IRQHandler                  /* FLASH interrupts  */
  .word     RAMECC_IRQHandler                 /* RAMECC interrupts   */
  .word     FPU_IRQHandler                    /* FPU */
  .word     0                                 /* Reserved */
  .word     0                                 /* Reserved */
  .word     TAMP_IRQHandler                   /* Tamper and TimeStamp interrupts */
  .word     0                                 /* Reserved    */
  .word     0                                 /* Reserved    */
  .word     EXTI0_IRQHandler                  /* EXTI Line0  */
  .word     EXTI1_IRQHandler                  /* EXTI Line1  */
  .word     EXTI2_IRQHandler                  /* EXTI Line2  */
  .word     EXTI3_IRQHandler                  /* EXTI Line3  */
  .word     EXTI4_IRQHandler                  /* EXTI Line4  */
  .word     EXTI5_IRQHandler                  /* EXTI Line5  */
  .word     EXTI6_IRQHandler                  /* EXTI Line6  */
  .word     EXTI7_IRQHandler                  /* EXTI Line7  */
  .word     EXTI8_IRQHandler                  /* EXTI Line8  */
  .word     EXTI9_IRQHandler                  /* EXTI Line9  */
  .word     EXTI10_IRQHandler                 /* EXTI Line10 */
  .word     EXTI11_IRQHandler                 /* EXTI Line11 */
  .word     EXTI12_IRQHandler                 /* EXTI Line12 */
  .word     EXTI13_IRQHandler                 /* EXTI Line13 */
  .word     EXTI14_IRQHandler                 /* EXTI Line14 */
  .word     EXTI15_IRQHandler                 /* EXTI Line15 */
  .word     RTC_IRQHandler                    /* RTC wakeup and alarm interrupts */
  .word     SAES_IRQHandler                   /* SAES */
  .word     CRYP_IRQHandler                   /* CRYP */
  .word     PKA_IRQHandler                    /* PKA  */
  .word     HASH_IRQHandler                   /* HASH */
  .word     RNG_IRQHandler                    /* RNG  */
  .word     ADC1_2_IRQHandler                 /* ADC1 & ADC2 */
  .word     GPDMA1_Channel0_IRQHandler        /* GPDMA1 Channel 0 */
  .word     GPDMA1_Channel1_IRQHandler        /* GPDMA1 Channel 1 */
  .word     GPDMA1_Channel2_IRQHandler        /* GPDMA1 Channel 2 */
  .word     GPDMA1_Channel3_IRQHandler        /* GPDMA1 Channel 3 */
  .word     GPDMA1_Channel4_IRQHandler        /* GPDMA1 Channel 4 */
  .word     GPDMA1_Channel5_IRQHandler        /* GPDMA1 Channel 5 */
  .word     GPDMA1_Channel6_IRQHandler        /* GPDMA1 Channel 6 */
  .word     GPDMA1_Channel7_IRQHandler        /* GPDMA1 Channel 7 */
  .word     TIM1_BRK_IRQHandler               /* TIM1 Break  */
  .word     TIM1_UP_IRQHandler                /* TIM1 Update */
  .word     TIM1_TRG_COM_IRQHandler           /* TIM1 Trigger and Commutation */
  .word     TIM1_CC_IRQHandler                /* TIM1 Capture Compare */
  .word     TIM2_IRQHandler                   /* TIM2 */
  .word     TIM3_IRQHandler                   /* TIM3 */
  .word     TIM4_IRQHandler                   /* TIM4 */
  .word     TIM5_IRQHandler                   /* TIM5 */
  .word     TIM6_IRQHandler                   /* TIM6 */
  .word     TIM7_IRQHandler                   /* TIM7 */
  .word     TIM9_IRQHandler                   /* TIM9 */
  .word     SPI1_IRQHandler                   /* SPI1 */
  .word     SPI2_IRQHandler                   /* SPI2 */
  .word     SPI3_IRQHandler                   /* SPI3 */
  .word     SPI4_IRQHandler                   /* SPI4 */
  .word     SPI5_IRQHandler                   /* SPI5 */
  .word     SPI6_IRQHandler                   /* SPI6 */
  .word     HPDMA1_Channel0_IRQHandler        /* HPDMA1 Channel 0 */
  .word     HPDMA1_Channel1_IRQHandler        /* HPDMA1 Channel 1 */
  .word     HPDMA1_Channel2_IRQHandler        /* HPDMA1 Channel 2 */
  .word     HPDMA1_Channel3_IRQHandler        /* HPDMA1 Channel 3 */
  .word     HPDMA1_Channel4_IRQHandler        /* HPDMA1 Channel 4 */
  .word     HPDMA1_Channel5_IRQHandler        /* HPDMA1 Channel 5 */
  .word     HPDMA1_Channel6_IRQHandler        /* HPDMA1 Channel 6 */
  .word     HPDMA1_Channel7_IRQHandler        /* HPDMA1 Channel 7 */
  .word     SAI1_A_IRQHandler                 /* Serial Audio Interface 1 block A */
  .word     SAI1_B_IRQHandler                 /* Serial Audio Interface 1 block B */
  .word     SAI2_A_IRQHandler                 /* Serial Audio Interface 2 block A */
  .word     SAI2_B_IRQHandler                 /* Serial Audio Interface 2 block B */
  .word     I2C1_EV_IRQHandler                /* I2C1 Event */
  .word     I2C1_ER_IRQHandler                /* I2C1 Error */
  .word     I2C2_EV_IRQHandler                /* I2C2 Event */
  .word     I2C2_ER_IRQHandler                /* I2C2 Error */
  .word     I2C3_EV_IRQHandler                /* I2C3 Event */
  .word     I2C3_ER_IRQHandler                /* I2C3 Error */
  .word     UART1_IRQHandler                 /* UART1 */
  .word     UART2_IRQHandler                 /* UART2 */
  .word     UART3_IRQHandler                 /* UART3 */
  .word     UART4_IRQHandler                  /* UART4 */
  .word     UART5_IRQHandler                  /* UART5 */
  .word     UART7_IRQHandler                  /* UART7 */
  .word     UART8_IRQHandler                  /* UART8 */
  .word     I3C1_EV_IRQHandler                /* I3C1 Event */
  .word     I3C1_ER_IRQHandler                /* I3C1 Error */
  .word     OTG_HS_IRQHandler                 /* USB OTG HS */
  .word     ETH_IRQHandler                    /* Ethernet */
  .word     CORDIC_IRQHandler                 /* CORDIC */
  .word     GFXTIM_IRQHandler                 /* GFXTIM */
  .word     DCMIPP_IRQHandler                 /* DCMIPP */
  .word     LTDC_IRQHandler                   /* LTDC   */
  .word     LTDC_ER_IRQHandler                /* LTDC error  */
  .word     DMA2D_IRQHandler                  /* DMA2D  */
  .word     JPEG_IRQHandler                   /* JPEG   */
  .word     GFXMMU_IRQHandler                 /* GFXMMU */
  .word     I3C1_WKUP_IRQHandler              /* I3C1 wakeup */
  .word     MCE1_IRQHandler                   /* MCE1  */
  .word     MCE2_IRQHandler                   /* MCE2  */
  .word     MCE3_IRQHandler                   /* MCE3  */
  .word     XSPI1_IRQHandler                  /* XSPI1 */
  .word     XSPI2_IRQHandler                  /* XSPI2 */
  .word     FMC_IRQHandler                    /* FMC */
  .word     SDMMC1_IRQHandler                 /* SDMMC1 */
  .word     SDMMC2_IRQHandler                 /* SDMMC2 */
  .word     0                                 /* Reserved */
  .word     0                                 /* Reserved */
  .word     OTG_FS_IRQHandler                 /* USB OTG FS */
  .word     TIM12_IRQHandler                  /* TIM12 */
  .word     TIM13_IRQHandler                  /* TIM13 */
  .word     TIM14_IRQHandler                  /* TIM14 */
  .word     TIM15_IRQHandler                  /* TIM15 */
  .word     TIM16_IRQHandler                  /* TIM16 */
  .word     TIM17_IRQHandler                  /* TIM17 */
  .word     LPTIM1_IRQHandler                 /* LP TIM1 */
  .word     LPTIM2_IRQHandler                 /* LP TIM2 */
  .word     LPTIM3_IRQHandler                 /* LP TIM3 */
  .word     LPTIM4_IRQHandler                 /* LP TIM4 */
  .word     LPTIM5_IRQHandler                 /* LP TIM5 */
  .word     SPDIF_RX_IRQHandler               /* SPDIF_RX */
  .word     MDIOS_IRQHandler                  /* MDIOS */
  .word     ADF1_FLT0_IRQHandler              /* ADF1 Filter 0 */
  .word     CRS_IRQHandler                    /* CRS */
  .word     UCPD1_IRQHandler                  /* UCPD1 */
  .word     CEC_IRQHandler                    /* HDMI_CEC */
  .word     PSSI_IRQHandler                   /* PSSI */
  .word     LPUART1_IRQHandler                /* LP UART1 */
  .word     WAKEUP_PIN_IRQHandler             /* Wake-up pins interrupt */
  .word     GPDMA1_Channel8_IRQHandler        /* GPDMA1 Channel 8  */
  .word     GPDMA1_Channel9_IRQHandler        /* GPDMA1 Channel 9  */
  .word     GPDMA1_Channel10_IRQHandler       /* GPDMA1 Channel 10 */
  .word     GPDMA1_Channel11_IRQHandler       /* GPDMA1 Channel 11 */
  .word     GPDMA1_Channel12_IRQHandler       /* GPDMA1 Channel 12 */
  .word     GPDMA1_Channel13_IRQHandler       /* GPDMA1 Channel 13 */
  .word     GPDMA1_Channel14_IRQHandler       /* GPDMA1 Channel 14 */
  .word     GPDMA1_Channel15_IRQHandler       /* GPDMA1 Channel 15 */
  .word     HPDMA1_Channel8_IRQHandler        /* HPDMA1 Channel 8  */
  .word     HPDMA1_Channel9_IRQHandler        /* HPDMA1 Channel 9  */
  .word     HPDMA1_Channel10_IRQHandler       /* HPDMA1 Channel 10 */
  .word     HPDMA1_Channel11_IRQHandler       /* HPDMA1 Channel 11 */
  .word     HPDMA1_Channel12_IRQHandler       /* HPDMA1 Channel 12 */
  .word     HPDMA1_Channel13_IRQHandler       /* HPDMA1 Channel 13 */
  .word     HPDMA1_Channel14_IRQHandler       /* HPDMA1 Channel 14 */
  .word     HPDMA1_Channel15_IRQHandler       /* HPDMA1 Channel 15 */
  .word     GPU2D_IRQHandler                  /* GPU2D */
  .word     GPU2D_ER_IRQHandler               /* GPU2D error */
  .word     ICACHE_IRQHandler                 /* ICACHE */
  .word     FDCAN1_IT0_IRQHandler             /* FDCAN1 Interrupt 0 */
  .word     FDCAN1_IT1_IRQHandler             /* FDCAN1 Interrupt 1 */
  .word     FDCAN2_IT0_IRQHandler             /* FDCAN2 Interrupt 0 */
  .word     FDCAN2_IT1_IRQHandler             /* FDCAN2 Interrupt 1 */

